Applying **Development**:

```diff
module.complete.random_id.this: Refreshing state... [id=Qd_u]
module.complete.tls_private_key.this[0]: Refreshing state... [id=8fba8a624d2298eb55e5759e79aef2d28d3ebbc3]
module.complete.aws_iam_role.xg: Refreshing state... [id=sophos-xg-431716620221118154850496300000001]
module.complete.aws_key_pair.this[0]: Refreshing state... [id=sophos-xg-431716620221118154854824700000006]
module.complete.aws_secretsmanager_secret.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:config_backup_password20221118154850498300000002-85tgvY]
module.complete.aws_secretsmanager_secret.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:console_password20221118154850503100000003-T3ebHX]
module.complete.aws_eip.this[0]: Refreshing state... [id=eipalloc-084010f3469f10494]
module.complete.data.aws_ami_ids.sfos: Reading...
module.complete.aws_vpc.this[0]: Refreshing state... [id=vpc-02def65baaa9b088f]
module.complete.data.aws_eip.by_filter: Reading...
module.complete.aws_secretsmanager_secret_version.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:console_password20221118154850503100000003-T3ebHX|F0E6DE37-B681-477B-BEE3-4DB85CC54A3E]
module.complete.data.aws_iam_policy_document.policy: Reading...
module.complete.aws_secretsmanager_secret_version.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:config_backup_password20221118154850498300000002-85tgvY|0E99DA32-0DDD-4DD7-BBF8-35EED68300DC]
module.complete.data.aws_iam_policy_document.policy: Read complete after 0s [id=2262552383]
module.complete.data.aws_eip.by_filter: Read complete after 0s [id=eipalloc-084010f3469f10494]
module.complete.data.aws_ami_ids.sfos: Read complete after 1s [id=1726762986]
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-037703324ef265430"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Read complete after 0s [id=ami-091558582143f9648]
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Read complete after 0s [id=ami-026c32ba32c93b8c4]
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Read complete after 0s [id=ami-04b0be28f678af9ee]
module.complete.data.aws_ami.dynamic_ami["ami-0d7615ce54a8138e1"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Read complete after 0s [id=ami-0f37b9b5182756d01]
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Read complete after 0s [id=ami-07186848dc5aa7580]
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Read complete after 0s [id=ami-030bf19f87a227c8a]
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Read complete after 0s [id=ami-065fabeba927f04d3]
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-037703324ef265430"]: Read complete after 0s [id=ami-037703324ef265430]
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Reading...
module.complete.aws_iam_role_policy.xg: Refreshing state... [id=sophos-xg-431716620221118154850496300000001:sophos-xg-431716620221118154851322600000004]
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Read complete after 0s [id=ami-0442ca42ae7162b75]
module.complete.aws_iam_instance_profile.xg: Refreshing state... [id=sophos-xg-431716620221118154851324000000005]
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Read complete after 0s [id=ami-053dbe57dfe422765]
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Read complete after 0s [id=ami-03cbb6f8e3173ca7a]
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Read complete after 0s [id=ami-059bf44c0f5e904d9]
module.complete.data.aws_ami.dynamic_ami["ami-0d7615ce54a8138e1"]: Read complete after 0s [id=ami-0d7615ce54a8138e1]
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Read complete after 0s [id=ami-0b68236d144f48351]
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Read complete after 0s [id=ami-0eafce265f8e28d06]
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Read complete after 0s [id=ami-0fb2a8cf2684fdb0c]
module.complete.aws_launch_template.xg: Refreshing state... [id=lt-00ef06c7003624256]
module.complete.aws_security_group.public[0]: Refreshing state... [id=sg-02c90d9b58f63f134]
module.complete.aws_route_table.private[0]: Refreshing state... [id=rtb-0cd9571cfc51f80c0]
module.complete.aws_security_group.trusted[0]: Refreshing state... [id=sg-0f4bae77d3cacea7b]
module.complete.aws_internet_gateway.this[0]: Refreshing state... [id=igw-01baa06e03da64ef6]
module.complete.aws_security_group.lan[0]: Refreshing state... [id=sg-0f556d08686f3bf67]
module.complete.aws_route_table.public[0]: Refreshing state... [id=rtb-07d072f95e834546a]
module.complete.aws_route.public: Refreshing state... [id=r-rtb-07d072f95e834546a1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.complete.aws_eip_association.this[0] will be created
+   resource "aws_eip_association" "this" {
+       allocation_id        = "eipalloc-084010f3469f10494"
+       id                   = (known after apply)
+       instance_id          = (known after apply)
+       network_interface_id = (known after apply)
+       private_ip_address   = (known after apply)
+       public_ip            = (known after apply)
    }

  # module.complete.aws_instance.this will be created
+   resource "aws_instance" "this" {
+       ami                                  = (known after apply)
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = false
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = "sophos-xg-431716620221118154851324000000005"
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = (known after apply)
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = true
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       subnet_id                            = (known after apply)
+       tags                                 = {
+           "Name" = "sophos-firewall-tf"
        }
+       tags_all                             = {
+           "Name" = "sophos-firewall-tf"
        }
+       tenancy                              = (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = "eyJjb25maWdTZWNyZXRJZCI6ImFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjQ0NzU1Mjc1ODUzMDpzZWNyZXQ6Y29uZmlnX2JhY2t1cF9wYXNzd29yZDIwMjIxMTE4MTU0ODUwNDk4MzAwMDAwMDAyLTg1dGd2WSIsImhvc3RuYW1lIjoic29waG9zLWZpcmV3YWxsLXRmIiwicmVnaW9uIjoidXMtd2VzdC0yIiwic2VjcmV0SWQiOiJhcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0NDc1NTI3NTg1MzA6c2VjcmV0OmNvbnNvbGVfcGFzc3dvcmQyMDIyMTExODE1NDg1MDUwMzEwMDAwMDAwMy1UM2ViSFgiLCJzZW5kc3RhdHMiOiJvbiJ9"
+       user_data_replace_on_change          = true
+       vpc_security_group_ids               = (known after apply)

+       capacity_reservation_specification {
+           capacity_reservation_preference = (known after apply)

+           capacity_reservation_target {
+               capacity_reservation_id                 = (known after apply)
+               capacity_reservation_resource_group_arn = (known after apply)
            }
        }

+       ebs_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           snapshot_id           = (known after apply)
+           tags                  = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }

+       enclave_options {
+           enabled = (known after apply)
        }

+       ephemeral_block_device {
+           device_name  = (known after apply)
+           no_device    = (known after apply)
+           virtual_name = (known after apply)
        }

+       launch_template {
+           id      = "lt-00ef06c7003624256"
+           name    = (known after apply)
+           version = "$Latest"
        }

+       maintenance_options {
+           auto_recovery = (known after apply)
        }

+       metadata_options {
+           http_endpoint               = "enabled"
+           http_put_response_hop_limit = 1
+           http_tokens                 = "optional"
+           instance_metadata_tags      = "enabled"
        }

+       network_interface {
+           delete_on_termination = false
+           device_index          = 0
+           network_card_index    = 0
+           network_interface_id  = (known after apply)
        }
+       network_interface {
+           delete_on_termination = false
+           device_index          = 1
+           network_card_index    = 0
+           network_interface_id  = (known after apply)
        }

+       private_dns_name_options {
+           enable_resource_name_dns_a_record    = (known after apply)
+           enable_resource_name_dns_aaaa_record = (known after apply)
+           hostname_type                        = (known after apply)
        }

+       root_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           tags                  = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }
    }

  # module.complete.aws_network_interface.private will be created
+   resource "aws_network_interface" "private" {
+       arn                       = (known after apply)
+       description               = "ENI for Private Subnet"
+       id                        = (known after apply)
+       interface_type            = (known after apply)
+       ipv4_prefix_count         = (known after apply)
+       ipv4_prefixes             = (known after apply)
+       ipv6_address_count        = (known after apply)
+       ipv6_address_list         = (known after apply)
+       ipv6_address_list_enabled = false
+       ipv6_addresses            = (known after apply)
+       ipv6_prefix_count         = (known after apply)
+       ipv6_prefixes             = (known after apply)
+       mac_address               = (known after apply)
+       outpost_arn               = (known after apply)
+       owner_id                  = (known after apply)
+       private_dns_name          = (known after apply)
+       private_ip                = (known after apply)
+       private_ip_list           = (known after apply)
+       private_ip_list_enabled   = false
+       private_ips               = (known after apply)
+       private_ips_count         = (known after apply)
+       security_groups           = [
+           "sg-0f556d08686f3bf67",
        ]
+       source_dest_check         = false
+       subnet_id                 = (known after apply)
+       tags                      = {
+           "Name" = "Private ENI"
        }
+       tags_all                  = {
+           "Name" = "Private ENI"
        }

+       attachment {
+           attachment_id = (known after apply)
+           device_index  = (known after apply)
+           instance      = (known after apply)
        }
    }

  # module.complete.aws_network_interface.public will be created
+   resource "aws_network_interface" "public" {
+       arn                       = (known after apply)
+       description               = "ENI for Public Subnet"
+       id                        = (known after apply)
+       interface_type            = (known after apply)
+       ipv4_prefix_count         = (known after apply)
+       ipv4_prefixes             = (known after apply)
+       ipv6_address_count        = (known after apply)
+       ipv6_address_list         = (known after apply)
+       ipv6_address_list_enabled = false
+       ipv6_addresses            = (known after apply)
+       ipv6_prefix_count         = (known after apply)
+       ipv6_prefixes             = (known after apply)
+       mac_address               = (known after apply)
+       outpost_arn               = (known after apply)
+       owner_id                  = (known after apply)
+       private_dns_name          = (known after apply)
+       private_ip                = (known after apply)
+       private_ip_list           = (known after apply)
+       private_ip_list_enabled   = false
+       private_ips               = (known after apply)
+       private_ips_count         = (known after apply)
+       security_groups           = [
+           "sg-02c90d9b58f63f134",
+           "sg-0f4bae77d3cacea7b",
        ]
+       source_dest_check         = false
+       subnet_id                 = (known after apply)
+       tags                      = {
+           "Name" = "Public ENI"
        }
+       tags_all                  = {
+           "Name" = "Public ENI"
        }

+       attachment {
+           attachment_id = (known after apply)
+           device_index  = (known after apply)
+           instance      = (known after apply)
        }
    }

  # module.complete.aws_route.private will be created
+   resource "aws_route" "private" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = "rtb-0cd9571cfc51f80c0"
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.complete.aws_route_table_association.private will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = "rtb-0cd9571cfc51f80c0"
+       subnet_id      = (known after apply)
    }

  # module.complete.aws_route_table_association.public will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = "rtb-07d072f95e834546a"
+       subnet_id      = (known after apply)
    }

  # module.complete.aws_subnet.private[0] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-west-2c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.0.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "Private Subnet"
        }
+       tags_all                                       = {
+           "Name" = "Private Subnet"
        }
+       vpc_id                                         = "vpc-02def65baaa9b088f"
    }

  # module.complete.aws_subnet.public[0] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-west-2c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "Public Subnet"
        }
+       tags_all                                       = {
+           "Name" = "Public Subnet"
        }
+       vpc_id                                         = "vpc-02def65baaa9b088f"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

```
module.complete.random_id.this: Refreshing state... [id=Qd_u]
module.complete.tls_private_key.this[0]: Refreshing state... [id=8fba8a624d2298eb55e5759e79aef2d28d3ebbc3]
module.complete.aws_secretsmanager_secret.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:config_backup_password20221118154850498300000002-85tgvY]
module.complete.aws_eip.this[0]: Refreshing state... [id=eipalloc-084010f3469f10494]
module.complete.aws_key_pair.this[0]: Refreshing state... [id=sophos-xg-431716620221118154854824700000006]
module.complete.data.aws_ami_ids.sfos: Reading...
module.complete.aws_vpc.this[0]: Refreshing state... [id=vpc-02def65baaa9b088f]
module.complete.aws_iam_role.xg: Refreshing state... [id=sophos-xg-431716620221118154850496300000001]
module.complete.aws_secretsmanager_secret.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:console_password20221118154850503100000003-T3ebHX]
module.complete.data.aws_eip.by_filter: Reading...
module.complete.data.aws_eip.by_filter: Read complete after 0s [id=eipalloc-084010f3469f10494]
module.complete.aws_secretsmanager_secret_version.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:console_password20221118154850503100000003-T3ebHX|F0E6DE37-B681-477B-BEE3-4DB85CC54A3E]
module.complete.aws_secretsmanager_secret_version.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:config_backup_password20221118154850498300000002-85tgvY|0E99DA32-0DDD-4DD7-BBF8-35EED68300DC]
module.complete.data.aws_iam_policy_document.policy: Reading...
module.complete.data.aws_iam_policy_document.policy: Read complete after 0s [id=2262552383]
module.complete.aws_iam_instance_profile.xg: Refreshing state... [id=sophos-xg-431716620221118154851324000000005]
module.complete.aws_iam_role_policy.xg: Refreshing state... [id=sophos-xg-431716620221118154850496300000001:sophos-xg-431716620221118154851322600000004]
module.complete.data.aws_ami_ids.sfos: Read complete after 1s [id=1726762986]
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0d7615ce54a8138e1"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-037703324ef265430"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Read complete after 0s [id=ami-065fabeba927f04d3]
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Read complete after 0s [id=ami-0f37b9b5182756d01]
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Read complete after 0s [id=ami-059bf44c0f5e904d9]
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Read complete after 0s [id=ami-030bf19f87a227c8a]
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0d7615ce54a8138e1"]: Read complete after 0s [id=ami-0d7615ce54a8138e1]
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Read complete after 0s [id=ami-026c32ba32c93b8c4]
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Read complete after 0s [id=ami-0442ca42ae7162b75]
module.complete.aws_security_group.trusted[0]: Refreshing state... [id=sg-0f4bae77d3cacea7b]
module.complete.data.aws_ami.dynamic_ami["ami-037703324ef265430"]: Read complete after 0s [id=ami-037703324ef265430]
module.complete.aws_security_group.lan[0]: Refreshing state... [id=sg-0f556d08686f3bf67]
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Read complete after 0s [id=ami-07186848dc5aa7580]
module.complete.aws_route_table.private[0]: Refreshing state... [id=rtb-0cd9571cfc51f80c0]
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Read complete after 0s [id=ami-03cbb6f8e3173ca7a]
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Read complete after 0s [id=ami-0b68236d144f48351]
module.complete.aws_route_table.public[0]: Refreshing state... [id=rtb-07d072f95e834546a]
module.complete.aws_internet_gateway.this[0]: Refreshing state... [id=igw-01baa06e03da64ef6]
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Read complete after 0s [id=ami-0eafce265f8e28d06]
module.complete.aws_security_group.public[0]: Refreshing state... [id=sg-02c90d9b58f63f134]
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Read complete after 0s [id=ami-053dbe57dfe422765]
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Read complete after 0s [id=ami-04b0be28f678af9ee]
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Read complete after 0s [id=ami-0fb2a8cf2684fdb0c]
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Read complete after 1s [id=ami-091558582143f9648]
module.complete.aws_launch_template.xg: Refreshing state... [id=lt-00ef06c7003624256]
module.complete.aws_route.public: Refreshing state... [id=r-rtb-07d072f95e834546a1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # module.complete.aws_eip.this[0] will be destroyed
  - resource "aws_eip" "this" {
      - allocation_id        = "eipalloc-084010f3469f10494" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-084010f3469f10494" -> null
      - network_border_group = "us-west-1" -> null
      - public_dns           = "ec2-54-219-226-8.us-west-1.compute.amazonaws.com" -> null
      - public_ip            = "54.219.226.8" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Name" = "sophos-xg-4317166"
        } -> null
      - tags_all             = {
          - "Name" = "sophos-xg-4317166"
        } -> null
      - vpc                  = true -> null
    }

  # module.complete.aws_iam_instance_profile.xg will be destroyed
  - resource "aws_iam_instance_profile" "xg" {
      - arn         = "arn:aws:iam::447552758530:instance-profile/sophos-xg-431716620221118154851324000000005" -> null
      - create_date = "2022-11-18T15:48:51Z" -> null
      - id          = "sophos-xg-431716620221118154851324000000005" -> null
      - name        = "sophos-xg-431716620221118154851324000000005" -> null
      - name_prefix = "sophos-xg-4317166" -> null
      - path        = "/" -> null
      - role        = "sophos-xg-431716620221118154850496300000001" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
      - unique_id   = "AIPAWQNBZEMBDW6RMX5XP" -> null
    }

  # module.complete.aws_iam_role.xg will be destroyed
  - resource "aws_iam_role" "xg" {
      - arn                   = "arn:aws:iam::447552758530:role/sophos-xg-431716620221118154850496300000001" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-11-18T15:48:50Z" -> null
      - force_detach_policies = false -> null
      - id                    = "sophos-xg-431716620221118154850496300000001" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "sophos-xg-431716620221118154850496300000001" -> null
      - name_prefix           = "sophos-xg-4317166" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAWQNBZEMBM23R2UY55" -> null

      - inline_policy {
          - name   = "sophos-xg-431716620221118154851322600000004" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "secretsmanager:GetSecretValue",
                              - "secretsmanager:DescribeSecret",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:secretsmanager:us-west-1:447552758530:secret:console_password20221118154850503100000003-T3ebHX"
                          - Sid      = "ConsolePass"
                        },
                      - {
                          - Action   = [
                              - "secretsmanager:GetSecretValue",
                              - "secretsmanager:DescribeSecret",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:secretsmanager:us-west-1:447552758530:secret:config_backup_password20221118154850498300000002-85tgvY"
                          - Sid      = "ConfigBackupPass"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.complete.aws_iam_role_policy.xg will be destroyed
  - resource "aws_iam_role_policy" "xg" {
      - id          = "sophos-xg-431716620221118154850496300000001:sophos-xg-431716620221118154851322600000004" -> null
      - name        = "sophos-xg-431716620221118154851322600000004" -> null
      - name_prefix = "sophos-xg-4317166" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:DescribeSecret",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:us-west-1:447552758530:secret:console_password20221118154850503100000003-T3ebHX"
                      - Sid      = "ConsolePass"
                    },
                  - {
                      - Action   = [
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:DescribeSecret",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:us-west-1:447552758530:secret:config_backup_password20221118154850498300000002-85tgvY"
                      - Sid      = "ConfigBackupPass"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "sophos-xg-431716620221118154850496300000001" -> null
    }

  # module.complete.aws_internet_gateway.this[0] will be destroyed
  - resource "aws_internet_gateway" "this" {
      - arn      = "arn:aws:ec2:us-west-1:447552758530:internet-gateway/igw-01baa06e03da64ef6" -> null
      - id       = "igw-01baa06e03da64ef6" -> null
      - owner_id = "447552758530" -> null
      - tags     = {
          - "Name" = "Internet Gateway"
        } -> null
      - tags_all = {
          - "Name" = "Internet Gateway"
        } -> null
      - vpc_id   = "vpc-02def65baaa9b088f" -> null
    }

  # module.complete.aws_key_pair.this[0] will be destroyed
  - resource "aws_key_pair" "this" {
      - arn             = "arn:aws:ec2:us-west-1:447552758530:key-pair/sophos-xg-431716620221118154854824700000006" -> null
      - fingerprint     = "0d:7b:71:eb:54:a0:ef:5b:bf:15:0d:90:7f:db:e4:8e" -> null
      - id              = "sophos-xg-431716620221118154854824700000006" -> null
      - key_name        = "sophos-xg-431716620221118154854824700000006" -> null
      - key_name_prefix = "sophos-xg-4317166" -> null
      - key_pair_id     = "key-0f7c409e749b19503" -> null
      - key_type        = "rsa" -> null
      - public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC+4apSF42wBPiLLwWT7cEGT4dkhzFRsPf5uLzM9NK/LabR5hAc+eYYNqbwQjYWfg3PAdimqsT2nAI+5UvxG2TaGbIoQWObLO5hbT79SVvxkVRknWNAvxVxDa2jP8yLVf/W0QP5Mj7glpkqY9M0NJcTJ9JwU+zI7R3AKoPban+tq0X79KuN71NX1HJ5jaFJxZkoQtUNNsk5Sjej+bip3kLOmx7o3irpZgs5ofZxFWh3yq2DnyNQmFV12AcOSemceTPzqRfyNNSFdLWi0KRw5erwNRL+O4UXVu8wkR1vZN1GNM2WtEAOGjN74Kd2rKDLNZxj39bloKPDc8/SyjzT9krU4ZH2KhvAVL2RM1M6y6C4m/tgGYlOBRWz4MU/SxWPU0aq2jzfJ5qvJYGtLZE4j1D1TluMFt7+XmBYoqNpPeG2DkAOIJildVqektz4XwkoGXwuB0K/RL7hb5417vHYOJgez8wqAc0gl8kPhZAk4GkrDvSClgOISQi9ktP0bohG6QoomEeSdL+Q9uS7cfkN7/Hcj66P3XIYJjAXeU5yHTfZlLjLO5Av1sLi0OSNBFbqA1CL1p9Od24fBLqcLZiEGTsaaFzpdCVzRy1yNm0IFaXcdh+GF0F0fBUCTH4GTIgxCTKRgiK6rVQnJI8euNYUntmzOYeSrSEPM1+CfVDqWMLpGQ==" -> null
      - tags            = {} -> null
      - tags_all        = {} -> null
    }

  # module.complete.aws_launch_template.xg will be destroyed
  - resource "aws_launch_template" "xg" {
      - arn                     = "arn:aws:ec2:us-west-1:447552758530:launch-template/lt-00ef06c7003624256" -> null
      - default_version         = 1 -> null
      - disable_api_stop        = false -> null
      - disable_api_termination = false -> null
      - id                      = "lt-00ef06c7003624256" -> null
      - image_id                = "ami-0f37b9b5182756d01" -> null
      - instance_type           = "t3.medium" -> null
      - key_name                = "sophos-xg-431716620221118154854824700000006" -> null
      - latest_version          = 1 -> null
      - name                    = "sophos-xg-431716620221118154855094800000007" -> null
      - name_prefix             = "sophos-xg-4317166" -> null
      - security_group_names    = [] -> null
      - tags                    = {} -> null
      - tags_all                = {} -> null
      - user_data               = "eyJjb25maWdTZWNyZXRJZCI6ImFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjQ0NzU1Mjc1ODUzMDpzZWNyZXQ6Y29uZmlnX2JhY2t1cF9wYXNzd29yZDIwMjIxMTE4MTU0ODUwNDk4MzAwMDAwMDAyLTg1dGd2WSIsImhvc3RuYW1lIjoic29waG9zLWZpcmV3YWxsLXRmIiwicmVnaW9uIjoidXMtd2VzdC0yIiwic2VjcmV0SWQiOiJhcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0NDc1NTI3NTg1MzA6c2VjcmV0OmNvbnNvbGVfcGFzc3dvcmQyMDIyMTExODE1NDg1MDUwMzEwMDAwMDAwMy1UM2ViSFgiLCJzZW5kc3RhdHMiOiJvbiJ9" -> null
      - vpc_security_group_ids  = [] -> null

      - block_device_mappings {
          - device_name = "/dev/xvda" -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "false" -> null
              - iops                  = 0 -> null
              - throughput            = 0 -> null
              - volume_size           = 16 -> null
              - volume_type           = "gp2" -> null
            }
        }
      - block_device_mappings {
          - device_name = "/dev/xvdg" -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "false" -> null
              - iops                  = 0 -> null
              - throughput            = 0 -> null
              - volume_size           = 80 -> null
              - volume_type           = "gp2" -> null
            }
        }

      - iam_instance_profile {
          - name = "sophos-xg-431716620221118154850496300000001" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "enabled" -> null
        }
    }

  # module.complete.aws_route.public will be destroyed
  - resource "aws_route" "public" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - gateway_id             = "igw-01baa06e03da64ef6" -> null
      - id                     = "r-rtb-07d072f95e834546a1080289494" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-07d072f95e834546a" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.complete.aws_route_table.private[0] will be destroyed
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-west-1:447552758530:route-table/rtb-0cd9571cfc51f80c0" -> null
      - id               = "rtb-0cd9571cfc51f80c0" -> null
      - owner_id         = "447552758530" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name" = "Private Route Table"
        } -> null
      - tags_all         = {
          - "Name" = "Private Route Table"
        } -> null
      - vpc_id           = "vpc-02def65baaa9b088f" -> null
    }

  # module.complete.aws_route_table.public[0] will be destroyed
  - resource "aws_route_table" "public" {
      - arn              = "arn:aws:ec2:us-west-1:447552758530:route-table/rtb-07d072f95e834546a" -> null
      - id               = "rtb-07d072f95e834546a" -> null
      - owner_id         = "447552758530" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-01baa06e03da64ef6"
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "Public Route Table"
        } -> null
      - tags_all         = {
          - "Name" = "Public Route Table"
        } -> null
      - vpc_id           = "vpc-02def65baaa9b088f" -> null
    }

  # module.complete.aws_secretsmanager_secret.config_backup_password will be destroyed
  - resource "aws_secretsmanager_secret" "config_backup_password" {
      - arn                            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:config_backup_password20221118154850498300000002-85tgvY" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:config_backup_password20221118154850498300000002-85tgvY" -> null
      - name                           = "config_backup_password20221118154850498300000002" -> null
      - name_prefix                    = "config_backup_password" -> null
      - recovery_window_in_days        = 0 -> null
      - rotation_enabled               = false -> null
      - tags                           = {
          - "app" = "sophos_xg_firewall"
        } -> null
      - tags_all                       = {
          - "app" = "sophos_xg_firewall"
        } -> null
    }

  # module.complete.aws_secretsmanager_secret.console_password will be destroyed
  - resource "aws_secretsmanager_secret" "console_password" {
      - arn                            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:console_password20221118154850503100000003-T3ebHX" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:console_password20221118154850503100000003-T3ebHX" -> null
      - name                           = "console_password20221118154850503100000003" -> null
      - name_prefix                    = "console_password" -> null
      - recovery_window_in_days        = 0 -> null
      - rotation_enabled               = false -> null
      - tags                           = {
          - "app" = "sophos_xg_firewall"
        } -> null
      - tags_all                       = {
          - "app" = "sophos_xg_firewall"
        } -> null
    }

  # module.complete.aws_secretsmanager_secret_version.config_backup_password will be destroyed
  - resource "aws_secretsmanager_secret_version" "config_backup_password" {
      - arn            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:config_backup_password20221118154850498300000002-85tgvY" -> null
      - id             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:config_backup_password20221118154850498300000002-85tgvY|0E99DA32-0DDD-4DD7-BBF8-35EED68300DC" -> null
      - secret_id      = "arn:aws:secretsmanager:us-west-1:447552758530:secret:config_backup_password20221118154850498300000002-85tgvY" -> null
      - secret_string  = (sensitive value)
      - version_id     = "0E99DA32-0DDD-4DD7-BBF8-35EED68300DC" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # module.complete.aws_secretsmanager_secret_version.console_password will be destroyed
  - resource "aws_secretsmanager_secret_version" "console_password" {
      - arn            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:console_password20221118154850503100000003-T3ebHX" -> null
      - id             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:console_password20221118154850503100000003-T3ebHX|F0E6DE37-B681-477B-BEE3-4DB85CC54A3E" -> null
      - secret_id      = "arn:aws:secretsmanager:us-west-1:447552758530:secret:console_password20221118154850503100000003-T3ebHX" -> null
      - secret_string  = (sensitive value)
      - version_id     = "F0E6DE37-B681-477B-BEE3-4DB85CC54A3E" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # module.complete.aws_security_group.lan[0] will be destroyed
  - resource "aws_security_group" "lan" {
      - arn                    = "arn:aws:ec2:us-west-1:447552758530:security-group/sg-0f556d08686f3bf67" -> null
      - description            = "Security Group for private subnet. Allow everything by default" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all outbound from private subnet"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0f556d08686f3bf67" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all inbound from private subnet"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "Private Subnet" -> null
      - owner_id               = "447552758530" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "LAN"
        } -> null
      - tags_all               = {
          - "Name" = "LAN"
        } -> null
      - vpc_id                 = "vpc-02def65baaa9b088f" -> null
    }

  # module.complete.aws_security_group.public[0] will be destroyed
  - resource "aws_security_group" "public" {
      - arn                    = "arn:aws:ec2:us-west-1:447552758530:security-group/sg-02c90d9b58f63f134" -> null
      - description            = "Untrusted network restricted from access port 22 and 4444" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all traffic outbound"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-02c90d9b58f63f134" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow public access 0 - 21"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 21
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow public access 23 - 4443"
              - from_port        = 23
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 4443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow public access 4445 - 65535"
              - from_port        = 4445
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 65535
            },
        ] -> null
      - name                   = "Public" -> null
      - owner_id               = "447552758530" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "Public"
        } -> null
      - tags_all               = {
          - "Name" = "Public"
        } -> null
      - vpc_id                 = "vpc-02def65baaa9b088f" -> null
    }

  # module.complete.aws_security_group.trusted[0] will be destroyed
  - resource "aws_security_group" "trusted" {
      - arn                    = "arn:aws:ec2:us-west-1:447552758530:security-group/sg-0f4bae77d3cacea7b" -> null
      - description            = "Enable TCP access from trusted network" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all traffic outbound"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0f4bae77d3cacea7b" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "47.184.79.94/32",
                ]
              - description      = "Allow all from trusted IP"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 65535
            },
        ] -> null
      - name                   = "Trusted Network" -> null
      - owner_id               = "447552758530" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "Trusted Network"
        } -> null
      - tags_all               = {
          - "Name" = "Trusted Network"
        } -> null
      - vpc_id                 = "vpc-02def65baaa9b088f" -> null
    }

  # module.complete.aws_vpc.this[0] will be destroyed
  - resource "aws_vpc" "this" {
      - arn                                  = "arn:aws:ec2:us-west-1:447552758530:vpc/vpc-02def65baaa9b088f" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - default_network_acl_id               = "acl-02c844fca416c4e89" -> null
      - default_route_table_id               = "rtb-0833d4b6eeff8e3e7" -> null
      - default_security_group_id            = "sg-07a8acc843a05df7e" -> null
      - dhcp_options_id                      = "dopt-001808c76c9383c0b" -> null
      - enable_classiclink                   = false -> null
      - enable_classiclink_dns_support       = false -> null
      - enable_dns_hostnames                 = true -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-02def65baaa9b088f" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-0833d4b6eeff8e3e7" -> null
      - owner_id                             = "447552758530" -> null
      - tags                                 = {
          - "Name" = "terraform-aws-sophos-firewall"
        } -> null
      - tags_all                             = {
          - "Name" = "terraform-aws-sophos-firewall"
        } -> null
    }

  # module.complete.random_id.this will be destroyed
  - resource "random_id" "this" {
      - b64_std     = "sophos-xg-Qd/u" -> null
      - b64_url     = "sophos-xg-Qd_u" -> null
      - byte_length = 3 -> null
      - dec         = "sophos-xg-4317166" -> null
      - hex         = "sophos-xg-41dfee" -> null
      - id          = "Qd_u" -> null
      - prefix      = "sophos-xg-" -> null
    }

  # module.complete.tls_private_key.this[0] will be destroyed
  - resource "tls_private_key" "this" {
      - algorithm                     = "RSA" -> null
      - ecdsa_curve                   = "P224" -> null
      - id                            = "8fba8a624d2298eb55e5759e79aef2d28d3ebbc3" -> null
      - private_key_openssh           = (sensitive value)
      - private_key_pem               = (sensitive value)
      - private_key_pem_pkcs8         = (sensitive value)
      - public_key_fingerprint_md5    = "49:c2:9f:0f:0b:8a:51:06:2c:43:3e:48:25:19:f6:06" -> null
      - public_key_fingerprint_sha256 = "SHA256:A+QnhPNZakpbjqiBcH3o/VM5Z1p3nJoiPP6hTJY1cGk" -> null
      - public_key_openssh            = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC+4apSF42wBPiLLwWT7cEGT4dkhzFRsPf5uLzM9NK/LabR5hAc+eYYNqbwQjYWfg3PAdimqsT2nAI+5UvxG2TaGbIoQWObLO5hbT79SVvxkVRknWNAvxVxDa2jP8yLVf/W0QP5Mj7glpkqY9M0NJcTJ9JwU+zI7R3AKoPban+tq0X79KuN71NX1HJ5jaFJxZkoQtUNNsk5Sjej+bip3kLOmx7o3irpZgs5ofZxFWh3yq2DnyNQmFV12AcOSemceTPzqRfyNNSFdLWi0KRw5erwNRL+O4UXVu8wkR1vZN1GNM2WtEAOGjN74Kd2rKDLNZxj39bloKPDc8/SyjzT9krU4ZH2KhvAVL2RM1M6y6C4m/tgGYlOBRWz4MU/SxWPU0aq2jzfJ5qvJYGtLZE4j1D1TluMFt7+XmBYoqNpPeG2DkAOIJildVqektz4XwkoGXwuB0K/RL7hb5417vHYOJgez8wqAc0gl8kPhZAk4GkrDvSClgOISQi9ktP0bohG6QoomEeSdL+Q9uS7cfkN7/Hcj66P3XIYJjAXeU5yHTfZlLjLO5Av1sLi0OSNBFbqA1CL1p9Od24fBLqcLZiEGTsaaFzpdCVzRy1yNm0IFaXcdh+GF0F0fBUCTH4GTIgxCTKRgiK6rVQnJI8euNYUntmzOYeSrSEPM1+CfVDqWMLpGQ==
        EOT -> null
      - public_key_pem                = <<-EOT
            -----BEGIN PUBLIC KEY-----
            MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEAvuGqUheNsAT4iy8Fk+3B
            Bk+HZIcxUbD3+bi8zPTSvy2m0eYQHPnmGDam8EI2Fn4NzwHYpqrE9pwCPuVL8Rtk
            2hmyKEFjmyzuYW0+/Ulb8ZFUZJ1jQL8VcQ2toz/Mi1X/1tED+TI+4JaZKmPTNDSX
            EyfScFPsyO0dwCqD22p/ratF+/Srje9TV9RyeY2hScWZKELVDTbJOUo3o/m4qd5C
            zpse6N4q6WYLOaH2cRVod8qtg58jUJhVddgHDknpnHkz86kX8jTUhXS1otCkcOXq
            8DUS/juFF1bvMJEdb2TdRjTNlrRADhoze+CndqygyzWcY9/W5aCjw3PP0so80/ZK
            1OGR9iobwFS9kTNTOsuguJv7YBmJTgUVs+DFP0sVj1NGqto83yearyWBrS2ROI9Q
            9U5bjBbe/l5gWKKjaT3htg5ADiCYpXVanpLc+F8JKBl8LgdCv0S+4W+eNe7x2DiY
            Hs/MKgHNIJfJD4WQJOBpKw70gpYDiEkIvZLT9G6IRukKKJhHknS/kPbku3H5De/x
            3I+uj91yGCYwF3lOch032ZS4yzuQL9bC4tDkjQRW6gNQi9afTnduHwS6nC2YhBk7
            Gmhc6XQlc0ctcjZtCBWl3HYfhhdBdHwVAkx+BkyIMQkykYIiuq1UJySPHrjWFJ7Z
            szmHkq0hDzNfgn1Q6ljC6RkCAwEAAQ==
            -----END PUBLIC KEY-----
        EOT -> null
      - rsa_bits                      = 4096 -> null
    }

Plan: 0 to add, 0 to change, 20 to destroy.
module.complete.aws_eip.this[0]: Destroying... [id=eipalloc-084010f3469f10494]
module.complete.aws_security_group.trusted[0]: Destroying... [id=sg-0f4bae77d3cacea7b]
module.complete.aws_iam_instance_profile.xg: Destroying... [id=sophos-xg-431716620221118154851324000000005]
module.complete.aws_secretsmanager_secret_version.config_backup_password: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:config_backup_password20221118154850498300000002-85tgvY|0E99DA32-0DDD-4DD7-BBF8-35EED68300DC]
module.complete.aws_security_group.lan[0]: Destroying... [id=sg-0f556d08686f3bf67]
module.complete.aws_launch_template.xg: Destroying... [id=lt-00ef06c7003624256]
module.complete.aws_route_table.private[0]: Destroying... [id=rtb-0cd9571cfc51f80c0]
module.complete.aws_secretsmanager_secret_version.console_password: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:console_password20221118154850503100000003-T3ebHX|F0E6DE37-B681-477B-BEE3-4DB85CC54A3E]
module.complete.aws_security_group.public[0]: Destroying... [id=sg-02c90d9b58f63f134]
module.complete.aws_iam_role_policy.xg: Destroying... [id=sophos-xg-431716620221118154850496300000001:sophos-xg-431716620221118154851322600000004]
module.complete.aws_secretsmanager_secret_version.console_password: Destruction complete after 0s
module.complete.aws_secretsmanager_secret_version.config_backup_password: Destruction complete after 0s
module.complete.aws_route.public: Destroying... [id=r-rtb-07d072f95e834546a1080289494]
module.complete.aws_iam_role_policy.xg: Destruction complete after 0s
module.complete.aws_launch_template.xg: Destruction complete after 0s
module.complete.aws_secretsmanager_secret.config_backup_password: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:config_backup_password20221118154850498300000002-85tgvY]
module.complete.aws_key_pair.this[0]: Destroying... [id=sophos-xg-431716620221118154854824700000006]
module.complete.aws_secretsmanager_secret.console_password: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:console_password20221118154850503100000003-T3ebHX]
module.complete.aws_iam_instance_profile.xg: Destruction complete after 0s
module.complete.aws_iam_role.xg: Destroying... [id=sophos-xg-431716620221118154850496300000001]
module.complete.aws_key_pair.this[0]: Destruction complete after 1s
module.complete.tls_private_key.this[0]: Destroying... [id=8fba8a624d2298eb55e5759e79aef2d28d3ebbc3]
module.complete.tls_private_key.this[0]: Destruction complete after 0s
module.complete.aws_secretsmanager_secret.console_password: Destruction complete after 1s
module.complete.aws_secretsmanager_secret.config_backup_password: Destruction complete after 1s
module.complete.aws_iam_role.xg: Destruction complete after 1s
module.complete.aws_route_table.private[0]: Destruction complete after 1s
module.complete.aws_route.public: Destruction complete after 1s
module.complete.aws_route_table.public[0]: Destroying... [id=rtb-07d072f95e834546a]
module.complete.aws_internet_gateway.this[0]: Destroying... [id=igw-01baa06e03da64ef6]
module.complete.aws_eip.this[0]: Destruction complete after 1s
module.complete.random_id.this: Destroying... [id=Qd_u]
module.complete.random_id.this: Destruction complete after 0s
module.complete.aws_security_group.public[0]: Destruction complete after 1s
module.complete.aws_security_group.lan[0]: Destruction complete after 1s
module.complete.aws_security_group.trusted[0]: Destruction complete after 1s
module.complete.aws_internet_gateway.this[0]: Destruction complete after 0s
module.complete.aws_route_table.public[0]: Destruction complete after 0s
module.complete.aws_vpc.this[0]: Destroying... [id=vpc-02def65baaa9b088f]
module.complete.aws_vpc.this[0]: Destruction complete after 1s

Destroy complete! Resources: 20 destroyed.

```